% 此代码为挠度计算部分
clc;clear
n = 50 ;m = 50;   % change your input n & m here
a = 11.109;
b = 8.004;
hx = a/n ; hy = b/m;   % lisan first
A = zeros((n+1)*(m+1),(n+1)*(m+1));
B = zeros((n+1)*(m+1),1);
u = zeros((n+1)*(m+1),1);
x = zeros(n+1,1);
y = zeros(m+1,1);
UYX = zeros(m+1,n+1);
q1 = 3.5e3;q2 = 2.5e3;
q = q1 + q2;
t = 0.14;
E = 3e10;

miu = 0.2;
D = E*t^3/(12*(1-miu^2));

for i = 1:n+1
    A(i,i) = 1;
    A(m*(n+1)+i,m*(n+1)+i) = 1;
    B(i,1) = 0;
    B(m*(n+1)+i,1) = 0;

end

for i = 1:n+1
    A((2-1)*(n+1)+i, (3-1)*(n+1)+i) = 1;
    A((2-1)*(n+1)+i, (2-1)*(n+1)+i) = -2;
    A((m-1)*(n+1)+i, (m-1-1)*(n+1)+i) = 1;
    A((m-1)*(n+1)+i, (m-1)*(n+1)+i) = -2;
    B((2-1)*(n+1)+i, 1) = 0;
    B((m-1)*(n+1)+i, 1) = 0;
end

for j = 3:m-1
    A((j-1)*(n+1)+1, (j-1)*(n+1)+1) = 1;
    B((j-1)*(n+1)+1, 1) = 0;
    A((j-1)*(n+1)+2, (j-1)*(n+1)+3) = 1;
    A((j-1)*(n+1)+2, (j-1)*(n+1)+2) = -2;
    B((j-1)*(n+1)+2, 1) = 0;
    for i = 3:n-1
        A((j-1)*(n+1)+i, (j-1)*(n+1)+i+2) = 1/hx^4;
        A((j-1)*(n+1)+i, (j-1)*(n+1)+i+1) = -4/hx^4 - 4/(hx^2*hy^2);
        A((j-1)*(n+1)+i, (j-1)*(n+1)+i-1) = -4/hx^4 - 4/(hx^2*hy^2);
        A((j-1)*(n+1)+i, (j-1)*(n+1)+i-2) = 1/hx^4;

        A((j-1)*(n+1)+i, (j+2-1)*(n+1)+i) = 1/hy^4;
        A((j-1)*(n+1)+i, (j+1-1)*(n+1)+i) = -4/hy^4 - 4/(hx^2*hy^2);
        A((j-1)*(n+1)+i, (j-1-1)*(n+1)+i) = -4/hy^4 - 4/(hx^2*hy^2);
        A((j-1)*(n+1)+i, (j-2-1)*(n+1)+i) = 1/hy^4;

        A((j-1)*(n+1)+i, (j+1-1)*(n+1)+i+1) = 2/(hx^2*hy^2);
        A((j-1)*(n+1)+i, (j+1-1)*(n+1)+i-1) = 2/(hx^2*hy^2);
        A((j-1)*(n+1)+i, (j-1-1)*(n+1)+i+1) = 2/(hx^2*hy^2);
        A((j-1)*(n+1)+i, (j-1-1)*(n+1)+i-1) = 2/(hx^2*hy^2);

        A((j-1)*(n+1)+i, (j-1)*(n+1)+i) = 6/hx^4 + 6/hy^4 + 8/(hx^2*hy^2);
        B((j-1)*(n+1)+i, 1) = q/D;
    end

    A((j-1)*(n+1)+n, (j-1)*(n+1)+n-1) = 1;
    A((j-1)*(n+1)+n, (j-1)*(n+1)+n) = -2;
    B((j-1)*(n+1)+n, 1) = 0;
    A((j-1)*(n+1)+n+1, (j-1)*(n+1)+n+1) = 1;
    B((j-1)*(n+1)+n+1, 1) = 0;
end

for i = 1:n+1
    x(i,1) = (i-1)*hx;
end

for j = 1:m+1
    y(j,1) = (j-1)*hy;
end

u=A\B;    % solve here

for j = 1:m+1
    for i = 1:n+1
        UYX(j,i) = u((n+1)*(j-1)+i,1);
    end
end

surface(x,y,UYX,'EdgeColor','none');
colorbar;

w_max = max(UYX(:));
fprintf('最大挠度 w_max = %.6f m\n', w_max);